src/Documents/Scan_ПеремещениеИзделий/Scan_ПеремещениеИзделий.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Scan_ПеремещениеИзделий</name>
  <comment>Перемещение продуктов  (scania)</comment>
  <basedOn>Document.Scan_ЗаявкаНаДействие</basedOn>
  <registerRecords>AccumulationRegister.Scan_МестонахождениеИзделий</registerRecords>
  <registerRecords>AccumulationRegister.Scan_ЗаявкиНаДействия</registerRecords>
  <registerRecords>InformationRegister.Scan_ОстаткиПродуктовНаПлощадках</registerRecords>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.Scan_ЗаявкаНаДействие</types>
    </type>
  </attributes>
  <attributes>
    <name>МестоОтгрузки</name>
    <type>
      <types>CatalogRef.Scan_МестаХранения</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОтгрузки</name>
    <comment>удалить</comment>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>МестоДоставки</name>
    <type>
      <types>CatalogRef.Scan_МестаХранения</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаДоставки</name>
    <comment>удалить</comment>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ИзделияДляПеремещения</name>
    <attributes>
      <name>Изделие</name>
      <type>
        <types>CatalogRef.Scan_Изделия</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаПолучения</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаДоставки</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/InformationRegisters/Scan_КлючевыеДатыПроцессов/Scan_КлючевыеДатыПроцессов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Scan_КлючевыеДатыПроцессов</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Значение</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерНакладной1ДБ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>GUIDНакладной1ДБ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>ОбъектКлючевойДаты</name>
    <type>
      <types>EnumRef.Scan_ОбъектыКлючевыхДат</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Объект</name>
    <type>
      <types>CatalogRef.Scan_Изделия</types>
      <types>CatalogRef.Scan_ЗаказыНаЗавод</types>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидКлючевойДаты</name>
    <type>
      <types>EnumRef.Scan_КлючевыеДаты</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/Scan_ВзаимосвязьИзделийИЗаказов/Scan_ВзаимосвязьИзделийИЗаказов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Scan_ВзаимосвязьИзделийИЗаказов</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>ЗаказНаЗавод</name>
    <type>
      <types>CatalogRef.Scan_ЗаказыНаЗавод</types>
    </type>
  </resources>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <dimensions>
    <name>Изделие</name>
    <type>
      <types>CatalogRef.Scan_Изделия</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Enums/Scan_ТипыСклада/Scan_ТипыСклада.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>Scan_ТипыСклада</name>
  <enumValues>
    <name>АдресДоставки</name>
  </enumValues>
  <enumValues>
    <name>Хранение</name>
  </enumValues>
  <enumValues>
    <name>Производство</name>
  </enumValues>
</mdclass:Enum>

src/Catalogs/Scan_МестаХранения/Scan_МестаХранения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Scan_МестаХранения</name>
  <comment>Места хранения (отгрузки, доставки)</comment>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>Маршруты</name>
      <description>Маршруты</description>
    </items>
    <items>
      <name>МестаХраненияАдресаКлиентов</name>
      <description>Места хранения – адреса клиентов</description>
    </items>
    <items>
      <name>МестаХранения</name>
      <description>Места хранения (площадки)</description>
    </items>
  </predefined>
  <attributes>
    <name>IDExternalSystem</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АдресСкладаЛогистический</name>
    <type>
      <types>CatalogRef.Scan_АдресаХранения</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресСкладаФактический</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>БуквенныйКод</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>3</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОбновления</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗарубежныйКузовостроитель</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсходныйПункт</name>
    <type>
      <types>CatalogRef.Scan_МестаХранения</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоПродуктовНаПлощадке</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КонечныйПункт</name>
    <type>
      <types>CatalogRef.Scan_МестаХранения</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Scan_Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>КраткоеНаименование</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Маршрут</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Недействительный</name>
    <comment>Место хранения больше не используется в программе, но сведения о нем сохранены. Недействительные места хранения скрываются из всех списков при выборе или подборе в документах, и других местах программы.</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроверятьНаличиеВ1БД</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СкладПроизводителя</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СтанцияДилера</name>
    <type>
      <types>CatalogRef.Scan_Компании</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипСклада</name>
    <type>
      <types>EnumRef.Scan_ТипыСклада</types>
    </type>
  </attributes>
  <attributes>
    <name>ФормироватьЧекЛисты</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоИспользований</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>11</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НеЗапрещатьПеремещениеМестаХранения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СрокиДоставки</name>
    <attributes>
      <name>СрокДоставки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
          <scale>1</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СпособДоставки</name>
      <type>
        <types>EnumRef.Scan_СпособыДоставкиПродуктов</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/Documents/Scan_ПеремещениеИзделий/ManagerModule.bsl
//rarus tenkam 24.02.2017 mantis 8492 +++
Функция СформироватьЗаписатьПеремещение(МестоДоставки, ДатаДоставки, МассивПродуктов) Экспорт
	
	НовоеПеремещение = Документы.Scan_ПеремещениеИзделий.СоздатьДокумент();
	НовоеПеремещение.ХозОперация = Справочники.Scan_ХозяйственныеОперации.ПеремещениеИзделий;
	НовоеПеремещение.МестоДоставки = МестоДоставки;
	
	// rarus tenkam 15.08.2019 mantis 14427  +++
	//Для Каждого ТекПродукт Из МассивПродуктов Цикл
	//	НоваяСтрока = НовоеПеремещение.ИзделияДляПеремещения.Добавить();
	//	НоваяСтрока.Изделие = ТекПродукт.Изделие;
	//КонецЦикла;
	//	
	//Запрос = Новый Запрос;
	//Запрос.Текст = 
	//	"ВЫБРАТЬ
	//	|	Scan_Продукты.Ссылка КАК Продукт,
	//	|	Scan_Продукты.Изделие,
	//	|	Scan_Продукты.ЗаказНаЗавод,
	//	|	ЕСТЬNULL(Scan_Продукты.Изделие.МестоПроизводства, ЗНАЧЕНИЕ(Справочник.Scan_МестаХранения.ПустаяСсылка)) КАК МестоПроизводства,
	//	|	ЕСТЬNULL(Scan_Продукты.ЗаказНаЗавод.CDDПоставщик, ДАТАВРЕМЯ(1, 1, 1)) КАК CDDПоставщик,
	//	|	ЕСТЬNULL(Scan_Продукты.ЗаказНаЗавод.ПродуктДатаГотовности, ДАТАВРЕМЯ(1, 1, 1)) КАК ПродуктДатаГотовности
	//	|ИЗ
	//	|	Справочник.Scan_Продукты КАК Scan_Продукты
	//	|ГДЕ
	//	|	Scan_Продукты.Ссылка В (&МассивПродуктов)";
	//
	//Запрос.УстановитьПараметр("МассивПродуктов", МассивПродуктов);
	//
	//ТабРезультат = Запрос.Выполнить().Выгрузить();
	//Для Каждого ТекСтрока Из ТабРезультат Цикл
	
	Для Каждого ТекИзделие Из МассивПродуктов Цикл
		НоваяСтрока = НовоеПеремещение.ИзделияДляПеремещения.Добавить();
		НоваяСтрока.Изделие = ТекИзделие;
	КонецЦикла;
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Scan_Изделия.Ссылка КАК Изделие,
		|	Scan_Изделия.ЗаказНаЗавод,
		|	ЕСТЬNULL(Scan_Изделия.МестоПроизводства, ЗНАЧЕНИЕ(Справочник.Scan_МестаХранения.ПустаяСсылка)) КАК МестоПроизводства
		//rarus BProg_Gladkov 20.11.2019 0014452 ++ Ключевые даты перенесены в регистр.
		//|	ЕСТЬNULL(Scan_Изделия.ЗаказНаЗавод.CDDПоставщик, ДАТАВРЕМЯ(1, 1, 1)) КАК CDDПоставщик,
		//|	ЕСТЬNULL(Scan_Изделия.ЗаказНаЗавод.ПродуктДатаГотовности, ДАТАВРЕМЯ(1, 1, 1)) КАК ПродуктДатаГотовности
		//rarus BProg_Gladkov 20.11.2019 0014452 -- 
		|ИЗ
		|	Справочник.Scan_Изделия КАК Scan_Изделия
		|ГДЕ
		|	Scan_Изделия.Ссылка В (&МассивПродуктов)";
	
	Запрос.УстановитьПараметр("МассивПродуктов", МассивПродуктов);
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ТекСтрока = ВыборкаДетальныеЗаписи;
	// rarus tenkam 15.08.2019 mantis 14427 ---	
		//rarus tenkam 21.03.2017 mantis 9061 +++
		Если ТекСтрока.МестоПроизводства = Справочники.Scan_МестаХранения.ПустаяСсылка() Тогда
			Продолжить;
		КонецЕсли;
		//rarus tenkam 21.03.2017 mantis 9061 ---
		
		Если НовоеПеремещение.МестоОтгрузки <> ТекСтрока.МестоПроизводства Тогда
			НовоеПеремещение.МестоОтгрузки = ТекСтрока.МестоПроизводства;
		КонецЕсли;
		ПараметрыОтбора = Новый Структура;
		ПараметрыОтбора.Вставить("Изделие", ТекСтрока.Изделие);
		НайденныеСтроки = НовоеПеремещение.ИзделияДляПеремещения.НайтиСтроки(ПараметрыОтбора);
		
		Если НайденныеСтроки.Количество() = 0 Тогда
			НоваяСтрока = НовоеПеремещение.ИзделияДляПеремещения.Добавить();
			НоваяСтрока.Изделие = ТекСтрока.Изделие;
		Иначе
			НоваяСтрока = НайденныеСтроки[0];
		КонецЕсли;
		
		НоваяСтрока.ДатаПолучения = РегистрыСведений.Scan_КлючевыеДатыПроцессов.КлючеваяДата(ТекСтрока.ЗаказНаЗавод, "FinishDate") + 1; //rarus BProg_Gladkov 20.11.2019 0014452 +- ключевые даты перенесены в регистр.
		НоваяСтрока.ДатаДоставки = ДатаДоставки; 
		
	КонецЦикла;
	НовоеПеремещение.Комментарий = "Документ создан автоматически.";
	Попытка
		НовоеПеремещение.Записать(РежимЗаписиДокумента.Запись);	
		Возврат НовоеПеремещение.Ссылка;
	Исключение
		Возврат Неопределено;
	КонецПопытки;
	
КонецФункции
//rarus tenkam 24.02.2017 mantis 8492 ---

//rarus tenkam 23.03.2017 mantis 7179 +++
Функция УстановитьCDDфакт(ПеремещениеОбъект) Экспорт
	// rarus tenkam 13.06.2018 mantis 13160 +++
	ЭтоСкладПроизводителя = (ПеремещениеОбъект.МестоОтгрузки.ТипСклада = Перечисления.Scan_ТипыСклада.Производство И 
		ПеремещениеОбъект.МестоОтгрузки.СкладПроизводителя);
	ЭтоЗарубежныйКузовостроитель = (ПеремещениеОбъект.МестоОтгрузки.ТипСклада = Перечисления.Scan_ТипыСклада.АдресДоставки И 
		ПеремещениеОбъект.МестоОтгрузки.ЗарубежныйКузовостроитель);
		
	//Если ПеремещениеОбъект.МестоОтгрузки.ТипСклада = Перечисления.Scan_ТипыСклада.Производство И 
	//	ПеремещениеОбъект.МестоОтгрузки.СкладПроизводителя Тогда
	Если ЭтоСкладПроизводителя ИЛИ ЭтоЗарубежныйКузовостроитель Тогда

	// rarus tenkam 13.06.2018 mantis 13160 --- 	
		Для Каждого ТекСтрока Из ПеремещениеОбъект.ИзделияДляПеремещения Цикл
			// rarus tenkam 05.08.2019 mantis 14427 +++
			//ТекЗаказ = РегистрыСведений.Scan_ВзаимосвязьИзделийПродуктовИЗаказов.ПолучитьЗаказПоИзделию(ТекСтрока.Изделие);
			ТекЗаказ = РегистрыСведений.Scan_ВзаимосвязьИзделийИЗаказов.ПолучитьЗаказПоИзделию(ТекСтрока.Изделие);
			// rarus tenkam 05.08.2019 mantis 14427 ---
			// rarus tenkam 13.06.2018 mantis 13160 +++
			//Если ЗначениеЗаполнено(ТекЗаказ) И НЕ ЗначениеЗаполнено(ТекЗаказ.ПортСПБ) Тогда
			Если ЗначениеЗаполнено(ТекЗаказ) Тогда
				//rarus BProg_Dekin 13.11.2019 0014452 ++ Реквизит "ПортСПБ" удален
				//ПортСПБ = ТекЗаказ.ПортСПБ;
				ПортСПБ = РегистрыСведений.Scan_КлючевыеДатыПроцессов.КлючеваяДата(ТекЗаказ, "ПортСПБ"); 
				Если НЕ ЗначениеЗаполнено(ПортСПБ) ИЛИ (ЗначениеЗаполнено(ПортСПБ) И ЭтоЗарубежныйКузовостроитель) Тогда
					//// rarus tenkam 13.06.2018 mantis 13160 ---
					//ТекЗаказОбъект = ТекЗаказ.ПолучитьОбъект();
					// ТекЗаказОбъект.ПортСПБ = ТекСтрока.ДатаДоставки;
					//Попытка
					//	ТекЗаказОбъект.Записать();
					//	
					//	// rarus tenkam 31.05.2019 mantis 14224 +++
					//	// Запишем ключевую дату
					//	РегистрыСведений.Scan_КлючевыеДатыПроцессов.ЗаписьЗначенияРегистраСведения(ТекЗаказОбъект.Ссылка, 
					//							Перечисления.Scan_ОбъектыКлючевыхДат.ЗаказНаЗавод, ТекСтрока.ДатаДоставки,
					//							Перечисления.Scan_КлючевыеДаты.ПортСПБ, ТекущаяДата());			
					//	// rarus tenkam 31.05.2019 mantis 14224 ---
					//Исключение
					//	Сообщить("Не удалось установить дату CDD факт. в заказе " + ТекЗаказ + " по причине: " + ИнформацияОбОшибке());
					//КонецПопытки;
					
					Отказ = Ложь;
					РегистрыСведений.Scan_КлючевыеДатыПроцессов.ЗаписатьКлючевуюДатуОбъекта(ТекЗаказ, "ПортСПБ", ТекСтрока.ДатаДоставки,, Отказ);
					Если Отказ тогда
						ШаблонОшибки = Нстр("ru = 'Не удалось установить дату CDD факт в заказе %1'; en = 'Failed to set аctual CDD date in order %1'");
						Сообщить(СтрШаблон(ШаблонОшибки, ТекЗаказ));
					КонецЕсли;
				КонецЕсли;		// rarus tenkam 13.06.2018 mantis 13160 +
				//rarus BProg_Dekin 13.11.2019 0014452 --
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
КонецФункции

Функция ОчиститьCDDфакт(ПеремещениеОбъект) Экспорт
	Если ПеремещениеОбъект.МестоОтгрузки.ТипСклада = Перечисления.Scan_ТипыСклада.Производство И 
		ПеремещениеОбъект.МестоОтгрузки.СкладПроизводителя Тогда
		Для Каждого ТекСтрока Из ПеремещениеОбъект.ИзделияДляПеремещения Цикл
			// rarus tenkam 05.08.2019 mantis 14427 +++
			//ТекЗаказ = РегистрыСведений.Scan_ВзаимосвязьИзделийПродуктовИЗаказов.ПолучитьЗаказПоИзделию(ТекСтрока.Изделие);
			ТекЗаказ = РегистрыСведений.Scan_ВзаимосвязьИзделийИЗаказов.ПолучитьЗаказПоИзделию(ТекСтрока.Изделие);
			// rarus tenkam 05.08.2019 mantis 14427 ---
			
			
			//rarus BProg_Dekin 13.11.2019 0014452 ++ Реквизит "ПортСПБ" удален.
			//ПортСПБ = ТекЗаказ.ПортСПБ;
			ПортСПБ = РегистрыСведений.Scan_КлючевыеДатыПроцессов.КлючеваяДата(ТекЗаказ, "ПортСПБ"); 
			Если ЗначениеЗаполнено(ТекЗаказ) И ЗначениеЗаполнено(ПортСПБ) Тогда
			//	ТекЗаказОбъект = ТекЗаказ.ПолучитьОбъект();
			//	ТекЗаказОбъект.ПортСПБ = Дата('00010101');
			//	Попытка
			//		ТекЗаказОбъект.Записать();
			//		
			//		// rarus tenkam 31.05.2019 mantis 14224 +++
			//		// Запишем ключевую дату
			//		РегистрыСведений.Scan_КлючевыеДатыПроцессов.ЗаписьЗначенияРегистраСведения(ТекЗаказОбъект.Ссылка, 
			//		Перечисления.Scan_ОбъектыКлючевыхДат.ЗаказНаЗавод, Дата('00010101'),
			//		Перечисления.Scan_КлючевыеДаты.ПортСПБ, ТекущаяДата());			
			//		// rarus tenkam 31.05.2019 mantis 14224 ---
			//	Исключение
			//		Сообщить("Не удалось установить очистить CDD факт. в заказе " + ТекЗаказ + " по причине: " + ИнформацияОбОшибке());
			//	КонецПопытки;
			
				Отказ = Ложь;
				РегистрыСведений.Scan_КлючевыеДатыПроцессов.ЗаписатьКлючевуюДатуОбъекта(ТекЗаказ, "ПортСПБ", ТекСтрока.ДатаДоставки,, Отказ);
				Если Отказ тогда
					ШаблонОшибки = Нстр("ru = 'Не удалось очистить дату CDD факт в заказе %1.'; en = 'Failed to clean аctual CDD date in order %1.'");
					Сообщить(СтрШаблон(ШаблонОшибки, ТекЗаказ));
				КонецЕсли;
			КонецЕсли;
			//rarus BProg_Dekin 13.11.2019 0014452 --
		КонецЦикла;
	КонецЕсли;
КонецФункции

//rarus tenkam 23.03.2017 mantis 7179 ---
